#include <sys/types.h>
#include <unistd.h>
#include <stdio.h>
int main()
{
    pid_t pid, ppid;
int a = 0;
(void)fork();
fork();
fork();
fork();
/* При успішному створенні нового процесу з цього місця
псевдопаралельно починають працювати два процеси: старий і новий. Перед виконанням наступного виразу значення змінної a в обох процесах дорівнює 0 */
a = a+1;
/* Довідаємося ідентифікатори поточного і батьківського
процесу (у кожному з процесів !!!) */
pid = getpid();
    ppid = getppid();
/* Друкуємо значення PID, PPID і обчислене значення змінної a (у кожному з процесів !!!) */
    printf("My pid = %d, my ppid = %d, result = %d\n", (int)pid, (int)ppid, a);
return 0; }
